## Pandas Dataframe

In [1]:
# Creating an Empty DataFrame
import pandas as pd

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [2]:
# Creating a Dataframe from List
lst = ['Python','is','a','great','programming','language']

df = pd.DataFrame(lst)
print(df)

             0
0       Python
1           is
2            a
3        great
4  programming
5     language

In [3]:
# Creating DataFrame from dict of numpy array
import numpy as np

data = np.array([[2,4,6],[5,8,9],[1,3,6]])
df = pd.DataFrame(data, columns=['A','B','C'])
print(df)

   A  B  C
0  2  4  6
1  5  8  9
2  1  3  6

In [4]:
# create a Df from list of Dictionaries
data = {'city': ['Mumbai','Delhi','Bangalore','Chennai'],
        'population':[20.4,16.8,12.7,7.1],
        'area':[603.4,1484,709.1,426]}
df = pd.DataFrame(data)
print(df)

        city  population    area
0     Mumbai        20.4   603.4
1      Delhi        16.8  1484.0
2  Bangalore        12.7   709.1
3    Chennai         7.1   426.0

### Pandas Dataframe Index

In [5]:
# Accessing and Modifying the Index

data = {'Product':['Laptop','Phone','Tablet','Monitor','Keyboard'],
        'Price':[1000,800,300,250,50],
        'Category':['Electronics','Electronics','Electronics','Accessories','Accessories'],
        'Stock': [50,100,75,30,200]
        }

df = pd.DataFrame(data)
print(df)

    Product  Price     Category  Stock
0    Laptop   1000  Electronics     50
1     Phone    800  Electronics    100
2    Tablet    300  Electronics     75
3   Monitor    250  Accessories     30
4  Keyboard     50  Accessories    200

In [6]:
print(df.index)

RangeIndex(start=0, stop=5, step=1)

In [7]:
# 2 Custom Index
df_with_idx = df.set_index('Product')
print(df_with_idx)

          Price     Category  Stock
Product
Laptop     1000  Electronics     50
Phone       800  Electronics    100
Tablet      300  Electronics     75
Monitor     250  Accessories     30
Keyboard     50  Accessories    200

In [8]:
# 3 Resetting the index
df_reset = df.reset_index()
print(df_reset)

   index   Product  Price     Category  Stock
0      0    Laptop   1000  Electronics     50
1      1     Phone    800  Electronics    100
2      2    Tablet    300  Electronics     75
3      3   Monitor    250  Accessories     30
4      4  Keyboard     50  Accessories    200

In [10]:
# 4. Indexing with loc
row = df.loc[4]
print(row)

Product        Keyboard
Price                50
Category    Accessories
Stock               200
Name: 4, dtype: object

### Pandas Access DataFrame

In [11]:
data = {'Name': ['Arjun','Priya','Rahul','Anita','Vikram'],
        'Age': [27,29,23,34,26],
        'Gender': ['Male','Female','Male','Female','Male'],
        'Salary': [60000,65000,45000,80000,52000]
        }
df = pd.DataFrame(data)
print(df)

     Name  Age  Gender  Salary
0   Arjun   27    Male   60000
1   Priya   29  Female   65000
2   Rahul   23    Male   45000
3   Anita   34  Female   80000
4  Vikram   26    Male   52000

In [12]:
# 1. Accessing columns
age_column = df['Age']
print(age_column)

0    27
1    29
2    23
3    34
4    26
Name: Age, dtype: int64

In [13]:
# 2. Accessing Rows
row = df.iloc[1]
print(row)

Name       Priya
Age           29
Gender    Female
Salary     65000
Name: 1, dtype: object

In [14]:
# 3. Accessing multiple rows or columns
subset = df.loc[0:2, ['Name','Age']]
print(subset)

    Name  Age
0  Arjun   27
1  Priya   29
2  Rahul   23

In [16]:
# 4. Accessing rows based on condition
filtered_data = df[df['Age'] > 25]
print(filtered_data)

     Name  Age  Gender  Salary
0   Arjun   27    Male   60000
1   Priya   29  Female   65000
3   Anita   34  Female   80000
4  Vikram   26    Male   52000

In [17]:
# 5. Accesssing the specific cells with at and iat
salary = df.at[2,'Salary']
print(salary)

45000

In [18]:
salary2 = df.iat[1,3]
print(salary2)

65000

### Indexing and Selecting Data with Pandas

In [79]:
import pandas as pd

# load the csv file
data = pd.read_csv("people-100.csv", index_col="Index")
# print(data)
data
#display(data)

,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
Index,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
...,...,...,...,...,...,...,...,...
96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [27]:
# Indexing data using [] operator
# a. selecting a single column
single_col = data["First Name"]
single_col.head()

Index
1      Shelby
2     Phillip
3    Kristine
4     Yesenia
5        Lori
Name: First Name, dtype: object

In [32]:
# b. Selecting Multiple Columns
mult_col = data[["First Name","Last Name","Date of birth"]]
print(mult_col.head(10))

      First Name Last Name Date of birth
Index
1         Shelby   Terrell    1945-10-26
2        Phillip   Summers    1910-03-24
3       Kristine    Travis    1992-07-02
4        Yesenia  Martinez    2017-08-03
5           Lori      Todd    1938-12-01
6           Erin       Day    2015-10-28
7      Katherine      Buck    1989-01-22
8        Ricardo    Hinton    1924-03-26
9           Dave   Farrell    2018-10-06
10        Isaiah     Downs    1964-09-20

In [30]:
# 2. Indexing with .loc[]
# a. selcting a single row
single_row = data.loc[2]
print(single_row)

User Id                f90cD3E76f1A9b9
First Name                     Phillip
Last Name                      Summers
Sex                             Female
Email            bethany14@example.com
Phone                214.112.6044x4913
Date of birth               1910-03-24
Job Title               Phytotherapist
Name: 2, dtype: object

In [44]:
# b. selecting the multiple rows by the labels
mult_row = data.loc[1:5]
mult_row

,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
Index,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon

In [48]:
# c. selecting a specific rows and columns
spec_row_col = data.loc[[2,4],['First Name','Job Title']]
spec_row_col

      First Name          Job Title
Index
2        Phillip     Phytotherapist
4        Yesenia  Market researcher

In [49]:
# d. selecting all the rows and specific columns
all_row_col = data.loc[:,["Sex","Date of birth"]]
all_row_col

          Sex Date of birth
Index
1        Male    1945-10-26
2      Female    1910-03-24
3        Male    1992-07-02
4        Male    2017-08-03
5        Male    1938-12-01
...       ...           ...
96     Female    1954-07-30
97     Female    1932-04-29
98       Male    1994-12-28
99     Female    2012-04-12
100      Male    2016-11-15

[100 rows x 2 columns]

In [50]:
# 3. Indexing with .iloc[]
# a. single row by position
single_row_iloc = data.iloc[0]
single_row_iloc

User Id                 88F7B33d2bcf9f5
First Name                       Shelby
Last Name                       Terrell
Sex                                Male
Email              elijah57@example.net
Phone            001-084-906-7849x73518
Date of birth                1945-10-26
Job Title               Games developer
Name: 1, dtype: object

In [51]:
# b. selecting multiple rows by position
mult_row_iloc = data.iloc[0:3]
mult_row_iloc

,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
Index,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath

In [54]:
# c. selecting specific row & columns by position
spec_row_col_iloc = data.iloc[[0,2],[1,3]]
spec_row_col_iloc

      First Name   Sex
Index
1         Shelby  Male
3       Kristine  Male

In [55]:
# d. selecting all rows and specific columns by position
all_row_col_iloc = data.iloc[:,[2,4]]
all_row_col_iloc

       Last Name                       Email
Index
1        Terrell        elijah57@example.net
2        Summers       bethany14@example.com
3         Travis       bthompson@example.com
4       Martinez   kaitlinkaiser@example.com
5           Todd  buchananmanuel@example.net
...          ...                         ...
96        Barnes         bmartin@example.org
97     Patterson       latasha46@example.net
98          Bray        regina11@example.org
99      Oconnell  alexiscantrell@example.org
100      Bernard       pcopeland@example.org

[100 rows x 2 columns]

In [56]:
# 4. Other Indexing methods
# a. .head()
print(data.head())

               User Id First Name Last Name     Sex  \
Index
1      88F7B33d2bcf9f5     Shelby   Terrell    Male
2      f90cD3E76f1A9b9    Phillip   Summers  Female
3      DbeAb8CcdfeFC2c   Kristine    Travis    Male
4      A31Bee3c201ef58    Yesenia  Martinez    Male
5      1bA7A3dc874da3c       Lori      Todd    Male

                            Email                   Phone Date of birth  \
Index
1            elijah57@example.net  001-084-906-7849x73518    1945-10-26
2           bethany14@example.com       214.112.6044x4913    1910-03-24
3           bthompson@example.com            277.609.7938    1992-07-02
4       kaitlinkaiser@example.com            584.094.6111    2017-08-03
5      buchananmanuel@example.net       689-207-3558x7233    1938-12-01

                Job Title
Index
1         Games developer
2          Phytotherapist
3               Homeopath
4       Market researcher
5      Veterinary surgeon

In [81]:
# b. .tail()
print(data.tail(50))

               User Id First Name   Last Name     Sex  \
Index
51     eA3fDd79BE9f0E7      Heidi     Escobar  Female
52     aF0eE4547Bc025c      Brian    Oconnell  Female
53     9F5DeD7aD228F5a    Beverly     Esparza  Female
54     D3Fa0220dDE4d36  Nathaniel       Rivas  Female
55     60FdBFd5e7BE8fF      Debra       Payne  Female
56     D8bF5Ab2b98caff  Mackenzie       Rocha  Female
57     CD8d33aA25bc8BB   Courtney     Watkins  Female
58     Fac3BfFf0A3d03c       Fred       Olsen  Female
59     e552D7ddafe1FFb       Ryan      Nelson  Female
60     0f8deedb629A5f6      Grace      Phelps    Male
61     bB9e49E506F65ed      Shari   Daugherty    Male
62     Ed724605A403D91      Kelli      Garner    Male
63     0aBE5ACb18E0c10     Jackie     Bennett    Male
64     5D2cb63CaAF53f6     Leslie      Conway  Female
65     Ee6974f90eeCe18     Harold     Barnett  Female
66     cEf02C076afa07f      Larry      Harper    Male
67     9Df5Ba591bF3EFf       Mike        Ward  Female
68     3faB1CBfEFBDdD4   Brittney       Rubio  Female
69     Ebcefdf75eCb0a9      Frank      Pineda    Male
70     e75e5DBfcb68887     Sandra          Wu    Male
71     6a53a8D41dDF6de       Ryan      Benton    Male
72     F0d3bD1aaf9E3Bc     Tamara        Hull    Male
73     5bC87340799FBD0       Jean      Ritter  Female
74     dBfA17Aaf16b4ab   Veronica      Briggs  Female
75     c935b7Eb6FA0B0F        Kim     Andrews  Female
76     b3e15e65Ca2CcBf       Tina  Cunningham    Male
77     dade3452F0c32FD   Jonathon    Atkinson    Male
78     AdEd6cfD85DeC46   Jermaine        Reid  Female
79     DAf111987098ae4     Regina     Stevens    Male
80     6e6a5b885F6496d   Terrence        Huff    Male
81     12DCb4ED8E01D5C      Tyler       Foley  Female
82     E1cB5cA8CA7CC0a     Andrew      Waters    Male
83     AedDfaE8Cf49F07   Reginald  Stephenson    Male
84     bff9853aFAeF772    Douglas       Reese  Female
85     E883773cA5219Be      Helen  Williamson  Female
86     CB19EafEbBfF9eC      Mario      Vaughn    Male
87     5834700fbEd2771    Chelsea     Dickson    Male
88     2b0Ab1Dc9E01D7E     Dustin      Bailey    Male
89     3f3a3D89ad042Dd      Harry      Medina  Female
90     9425E2F38C408ef      Kathy       Haney  Female
91     F0aeC9c2759F3C6     Alison       Nixon  Female
92     d6EA619A7C4aA95      Jamie       Hardy  Female
93     2A33E7Cad1bb0F5     Melody         Cox  Female
94     d181FFB7d3E68bb     Xavier        Cole    Male
95     feaBf8dAE0C0d6F     Dillon      Guzman  Female
96     5eFda7caAeB260E     Dennis      Barnes  Female
97     CCbFce93d3720bE      Steve   Patterson  Female
98     2fEc528aFAF0b69     Wesley        Bray    Male
99     Adc7ad9B6e4A1Fe     Summer    Oconnell  Female
100    b8D0aD3490FC7e1     Mariah     Bernard    Male

                             Email                   Phone Date of birth  \
Index
51      staffordtravis@example.net       601-155-3065x1131    1931-09-25
52            saralong@example.net        952-283-1423x733    1911-10-23
53             iphelps@example.net    +1-327-578-8754x6771    1930-12-09
54           roberto29@example.com     (655)887-2040x37888    1908-11-17
55           yolanda07@example.org  001-731-525-8400x52593    1927-08-20
56        abbottyvette@example.net              4225525458    1980-10-21
57              ochang@example.org       210.683.2761x5883    2003-12-07
58         amyanderson@example.com            497-774-3053    1910-04-10
59             qnorman@example.org            956.330.2951    1924-05-02
60        clarkeangela@example.net      (034)867-8827x6777    1909-10-15
61           kalvarado@example.org   001-951-655-4798x6124    1944-11-24
62         jodyvincent@example.org       995.000.4213x0982    2010-01-17
63      hutchinsonkirk@example.com   001-740-937-0846x0087    1915-11-11
64     floreschristina@example.org        795.782.4384x555    1983-11-06
65            nathan65@example.org         +1-026-265-6392    1943-03-15
66             maria32@example.org    +1-244-630-3792x4121    2021-05-05
67         imccullough@example.com            116-729-5046    1967-11-09
68             corey92@example.com            593.976.2528    1959-12-24
69        daltoncalvin@example.net      (035)961-5060x9182    1926-03-10
70              ubanks@example.com     +1-096-606-6454x067    1925-04-28
71         lopezdebbie@example.org     +1-695-557-9948x485    2020-10-06
72            meagan39@example.net       017.665.3744x7944    1933-01-31
73          kristina76@example.com           (954)060-1066    1985-08-06
74        weissbridget@example.com   +1-521-589-2387x48490    1974-06-08
75           wpetersen@example.org              7677125383    1990-11-15
76            wongmary@example.org            079-907-5051    1956-11-29
77          gailfrench@example.net        874-037-2032x932    2011-07-19
78               vpaul@example.com           (742)214-8691    1974-08-18
79              xpoole@example.net            891-359-2684    2011-11-28
80         cassandra80@example.org       221.800.6408x5416    1944-02-27
81         johnathan72@example.org   001-386-469-3075x8030    1908-09-19
82               nhall@example.net    +1-376-865-2765x3351    1948-05-14
83           erikaball@example.net     +1-832-500-6044x475    2010-02-08
84        nixonvanessa@example.net   001-834-660-8312x9864    1961-11-11
85            melvin08@example.net        001-377-726-4229    1911-08-11
86              oblake@example.com      160-144-5039x12276    1990-07-08
87     johnnyhendricks@example.net  001-698-651-0138x18588    1958-05-13
88             pbarron@example.net     +1-965-621-1157x345    1908-08-22
89          olsenmalik@example.net         +1-451-099-5805    1947-08-24
90            teresa37@example.com           (164)105-8456    1955-09-02
91              zmiles@example.net              3506680871    1941-07-10
92       sheenadouglas@example.com     (900)803-9295x11533    1994-07-17
93              evan90@example.org      (626)520-5080x3511    1974-07-30
94           nicolas90@example.org              8164259975    1938-11-29
95       angelanavarro@example.net            971-992-4521    1942-04-01
96             bmartin@example.org    001-095-524-2112x257    1954-07-30
97           latasha46@example.net        001-865-478-5157    1932-04-29
98            regina11@example.org      995-542-3004x76800    1994-12-28
99      alexiscantrell@example.org    001-273-685-6932x092    2012-04-12
100          pcopeland@example.org     (341)594-6554x44657    2016-11-15

                                               Job Title
Index
51                             Estate manager/land agent
52                                       Physiotherapist
53                           Passenger transport manager
54                                   Call centre manager
55                     Special educational needs teacher
56                    Museum/gallery exhibitions officer
57                                Pension scheme manager
58                                         Archaeologist
59     Historic buildings inspector/conservation officer
60                                    Petroleum engineer
61                                               Curator
62                                         Retail banker
63                                          Neurosurgeon
64                                          Chiropractor
65                                  Biochemist, clinical
66                              Scientist, water quality
67                                           Hydrologist
68                                  Biochemist, clinical
69                                   Hospital pharmacist
70                                     Warehouse manager
71                               Physiological scientist
72                  English as a second language teacher
73                                      Financial trader
74                                   Structural engineer
75                                  Biochemist, clinical
76                                Race relations officer
77                                Psychologist, forensic
78                                  Newspaper journalist
79                                  Public house manager
80                           Careers information officer
81                                             Economist
82                                    Jewellery designer
83                            Contracting civil engineer
84                             Higher education lecturer
85                           Lecturer, further education
86                    Research scientist (life sciences)
87                              Teacher, early years/pre
88                                 Travel agency manager
89                              Technical sales engineer
90                                    Charity fundraiser
91                                       Patent attorney
92                                Conservator, furniture
93                        Dance movement psychotherapist
94                                     Financial planner
95                                            Air broker
96                                     Software engineer
97                                             Barrister
98                                        Police officer
99                                  Broadcast journalist
100                                IT sales professional

In [80]:
# c. .at[]
value_at = data.at[5,"Email"]
print(value_at)

buchananmanuel@example.net

In [82]:
# d. .query()
male_record = data.query("Sex == 'Male'")
male_record

,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
Index,,,,,,,,
1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
6,bfDD7CDEF5D865B,Erin,Day,Male,tconner@example.org,001-171-649-9856x5553,2015-10-28,Waste management officer
8,2EFC6A4e77FaEaC,Ricardo,Hinton,Male,wyattbishop@example.com,001-447-699-7998x88612,1924-03-26,Hydrogeologist
9,baDcC4DeefD8dEB,Dave,Farrell,Male,nmccann@example.net,603-428-2429x27392,2018-10-06,Lawyer
10,8e4FB470FE19bF0,Isaiah,Downs,Male,virginiaterrell@example.org,+1-511-372-1544x8206,1964-09-20,"Engineer, site"
12,F738c69fB34E62E,Stacy,Newton,Male,rayleroy@example.org,710.673.3213x80335,1980-10-20,Warden/ranger
13,C03fDADdAadAdCe,Mandy,Blake,Male,jefferynoble@example.org,(992)466-1305x4947,2007-12-08,"Scientist, clinical (histocompatibility and im..."
15,1F0B7D65A00DAF9,Crystal,Farmer,Male,pmiranda@example.org,+1-024-377-5391,1992-03-09,Agricultural consultant
17,D6dbA5308fEC4BC,Maurice,Rangel,Male,sheenabanks@example.com,(246)187-4969,2004-08-20,Secretary/administrator
18,311D775990f066d,Frank,Meadows,Male,gbrewer@example.org,429.965.3902x4447,2008-09-16,Audiological scientist
19,7F7E1BAcb0C9AFf,Alvin,Paul,Male,gilbertdonaldson@example.com,219.436.0887x07551,1949-05-12,"Teacher, adult education"
23,cBbBcA0FCA3C4Bc,Randy,Barnes,Male,huangbill@example.org,001-960-629-7164x67214,1947-12-30,Outdoor activities/education manager
26,c9F2282C40BEC1E,Sean,Levine,Male,sallymiller@example.net,4915828504,2010-10-09,"Conservation officer, nature"
27,9c1bc7EC53Fb7cE,Louis,Payne,Male,bsullivan@example.net,6232695307,1916-01-29,Counsellor
29,66F096D36Ebae11,Judy,Buckley,Male,irosales@example.net,001-654-208-1241x52830,1963-07-28,Art gallery manager
30,F0fE2faAd78F8b5,Norman,Weber,Male,mconrad@example.com,223.002.0429,1957-05-21,Gaffer
32,cDa5F303fCd6dEa,Jacqueline,Gallagher,Male,nsampson@example.net,(247)762-8934,1999-02-25,Building services engineer
36,035eff50B9A0F24,Melody,Cook,Male,jeannovak@example.org,(826)792-7381,1963-06-25,Research scientist (life sciences)
37,aa614aAE4B7Cf0C,Leonard,Hurst,Male,clinton78@example.org,941-038-0427x38800,1938-03-13,"Accountant, chartered management"
45,5F2f3fAca8B0946,Darren,Andrews,Male,lhernandez@example.com,(975)799-4261,1997-10-04,Retail banker
48,Ee4eB129dC7913A,Becky,Brady,Male,erikmueller@example.org,(390)002-0863,1957-06-27,Seismic interpreter
49,dBCEf340C3657Eb,Caitlyn,Frey,Male,rivasdominique@example.org,805-021-3965x46344,1968-01-26,Jewellery designer
50,E47FB71DD9ACCd9,Joshua,Sweeney,Male,daisymcgee@example.net,875.994.2100x535,1954-07-28,"Education officer, museum"
60,0f8deedb629A5f6,Grace,Phelps,Male,clarkeangela@example.net,(034)867-8827x6777,1909-10-15,Petroleum engineer
61,bB9e49E506F65ed,Shari,Daugherty,Male,kalvarado@example.org,001-951-655-4798x6124,1944-11-24,Curator
62,Ed724605A403D91,Kelli,Garner,Male,jodyvincent@example.org,995.000.4213x0982,2010-01-17,Retail banker
63,0aBE5ACb18E0c10,Jackie,Bennett,Male,hutchinsonkirk@example.com,001-740-937-0846x0087,1915-11-11,Neurosurgeon
66,cEf02C076afa07f,Larry,Harper,Male,maria32@example.org,+1-244-630-3792x4121,2021-05-05,"Scientist, water quality"
69,Ebcefdf75eCb0a9,Frank,Pineda,Male,daltoncalvin@example.net,(035)961-5060x9182,1926-03-10,Hospital pharmacist
70,e75e5DBfcb68887,Sandra,Wu,Male,ubanks@example.com,+1-096-606-6454x067,1925-04-28,Warehouse manager
71,6a53a8D41dDF6de,Ryan,Benton,Male,lopezdebbie@example.org,+1-695-557-9948x485,2020-10-06,Physiological scientist
72,F0d3bD1aaf9E3Bc,Tamara,Hull,Male,meagan39@example.net,017.665.3744x7944,1933-01-31,English as a second language teacher
76,b3e15e65Ca2CcBf,Tina,Cunningham,Male,wongmary@example.org,079-907-5051,1956-11-29,Race relations officer
77,dade3452F0c32FD,Jonathon,Atkinson,Male,gailfrench@example.net,874-037-2032x932,2011-07-19,"Psychologist, forensic"
79,DAf111987098ae4,Regina,Stevens,Male,xpoole@example.net,891-359-2684,2011-11-28,Public house manager
80,6e6a5b885F6496d,Terrence,Huff,Male,cassandra80@example.org,221.800.6408x5416,1944-02-27,Careers information officer
82,E1cB5cA8CA7CC0a,Andrew,Waters,Male,nhall@example.net,+1-376-865-2765x3351,1948-05-14,Jewellery designer
83,AedDfaE8Cf49F07,Reginald,Stephenson,Male,erikaball@example.net,+1-832-500-6044x475,2010-02-08,Contracting civil engineer
86,CB19EafEbBfF9eC,Mario,Vaughn,Male,oblake@example.com,160-144-5039x12276,1990-07-08,Research scientist (life sciences)
87,5834700fbEd2771,Chelsea,Dickson,Male,johnnyhendricks@example.net,001-698-651-0138x18588,1958-05-13,"Teacher, early years/pre"
88,2b0Ab1Dc9E01D7E,Dustin,Bailey,Male,pbarron@example.net,+1-965-621-1157x345,1908-08-22,Travel agency manager
94,d181FFB7d3E68bb,Xavier,Cole,Male,nicolas90@example.org,8164259975,1938-11-29,Financial planner
98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

## Slicing Pandas Dataframe

In [1]:
import pandas as pd

player_list = [['M.S.Dhoni', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kohli', 31, 70, 8428000],
               ['S.Smith', 34,80, 4428000],
               ['C.Gayle',40,100, 4528000],
               ['J.Root',33, 72, 7028000],
               ['K.Petreson',42,85,2528000]]

df = pd.DataFrame(player_list, columns=['Name','Age','Weight','Salary'])
print(df)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Petreson   42      85  2528000

In [2]:
## Slicing using iloc[]
df1 = df.iloc[0:4]
print(df1)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000

In [3]:
# slicing columns 
df2 = df.iloc[:,0:2]
print(df2)

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38
2        V.Kohli   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Petreson   42

In [4]:
# Selecting a specific cell 
value = df.iloc[2,3]
print("Specific Cell Value: ",value)

Specific Cell Value:  8428000

In [6]:
# Using Boolean condition
data = df[df['Age'] > 35].iloc[:,:]
print("\nFiltered Data based on age: \n",data)

Filtered Data based on age:
             Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Petreson   42      85  2528000

In [7]:
## Slicing using loc[]
# Slicing rows
df.set_index('Name',inplace=True)

custom = df.loc['A.B.D Villers':'S.Smith']
print(custom)

               Age  Weight   Salary
Name
A.B.D Villers   38      74  3428000
V.Kohli         31      70  8428000
S.Smith         34      80  4428000

In [8]:
# Selecting Specified cell
value = df.loc['V.Kohli','Salary']
print("\nValue of the Specific cell :",value)

Value of the Specific cell : 8428000

## Sort Pandas DataFrame

In [31]:
# 1. Sort DF by one column
data = {'Name': ['Akash','Bharti','Chandan','Divya'],
        'Age': [25,35,30,40],
        'Score':[100,90,95,80]
        }
df = pd.DataFrame(data)

sorted_df = df.sort_values(by="Age")
print(sorted_df)

      Name  Age  Score
0    Akash   25    100
2  Chandan   30     95
1   Bharti   35     90
3    Divya   40     80

In [11]:
sorted_df = df.sort_values(by="Age", ascending=False)
print(sorted_df)

      Name  Age  Score
3    Divya   40     80
1   Bharti   35     90
2  Chandan   30     95
0    Akash   25     85

In [41]:
# 2. Sort by Multiple Columns
sorted_df = df.sort_values(by=['Age','Score'],ascending=[False,True])
print(sorted_df)

      Name  Age  Score
3    Divya   40     80
1   Bharti   35     90
2  Chandan   30     95
0    Akash   25    100

In [42]:
# 3. Sort with Missing Values
data_with_nan = {"Name": ["Alice", "Bob", "Charlie", "David"],"Age": [28, 22, None, 22]}

df_nan = pd.DataFrame(data_with_nan)

sorted_df = df_nan.sort_values(by="Age", na_position="first")
print(sorted_df)

      Name   Age
2  Charlie   NaN
1      Bob  22.0
3    David  22.0
0    Alice  28.0

In [43]:
# Choosing the Sorting Algorithm - quicksort, mergesort, heapsort
data = {'Name': ['Akash','Bharti','Chandan','Divya'],
        'Age': [25,35,30,40],
        'Score':[100,90,95,80]
        }

df = pd.DataFrame(data)

sorted_df1 = df.sort_values(by='Age', kind='mergesort')
print(sorted_df1)

      Name  Age  Score
0    Akash   25    100
2  Chandan   30     95
1   Bharti   35     90
3    Divya   40     80

In [45]:
# Custom sorting with Key Functions
sorted_df = df.sort_values(by='Name', key=lambda col: col.str.startswith('B'))
print(sorted_df)

      Name  Age  Score
0    Akash   25    100
2  Chandan   30     95
3    Divya   40     80
1   Bharti   35     90

In [48]:
filtered_df = df[df['Name'].str.startswith('A')]
print(filtered_df)

    Name  Age  Score
0  Akash   25    100

## Pivot Table Using Pandas

In [49]:
df = pd.DataFrame({'Product': ['Carrots', 'Broccoli', 'Banana', 'Banana',
                               'Beans', 'Orange', 'Broccoli', 'Banana'],
                   'Category': ['Vegetable', 'Vegetable', 'Fruit', 'Fruit',
                                'Vegetable', 'Fruit', 'Vegetable', 'Fruit'],
                   'Quantity': [8, 5, 3, 4, 5, 9, 11, 8],
                   'Amount': [270, 239, 617, 384, 626, 610, 62, 90]})
df

    Product   Category  Quantity  Amount
0   Carrots  Vegetable         8     270
1  Broccoli  Vegetable         5     239
2    Banana      Fruit         3     617
3    Banana      Fruit         4     384
4     Beans  Vegetable         5     626
5    Orange      Fruit         9     610
6  Broccoli  Vegetable        11      62
7    Banana      Fruit         8      90

In [50]:
## Create a Pivot Table
# Get the total sales of each Product
pivot = df.pivot_table(index=['Product'],
                       values=['Amount'],
                       aggfunc='sum')
pivot

          Amount
Product
Banana      1091
Beans        626
Broccoli     301
Carrots      270
Orange       610

In [51]:
# Get the total sales of each category
pivot = df.pivot_table(index=['Category'],
                       values=['Amount'],
                       aggfunc='sum')
pivot

           Amount
Category
Fruit        1701
Vegetable    1197

In [52]:
# Get Total Sales by Category and Product

pivot = df.pivot_table(index=['Product','Category'],
                       values=['Amount'],
                       aggfunc='sum')
pivot

                    Amount
Product  Category
Banana   Fruit        1091
Beans    Vegetable     626
Broccoli Vegetable     301
Carrots  Vegetable     270
Orange   Fruit         610

In [53]:
# Get the mean, Median, Minimum Sale by Category
pivot = df.pivot_table(index=['Category'],
                       values=['Amount'],
                       aggfunc={'median','mean','min'})
pivot

           Amount
             mean median min
Category
Fruit      425.25  497.0  90
Vegetable  299.25  254.5  62

In [54]:
# sale by Product
pivot = df.pivot_table(index=['Product'],
                       values=['Amount'],
                       aggfunc={'median','mean','min'})
pivot

              Amount
                mean median  min
Product
Banana    363.666667  384.0   90
Beans     626.000000  626.0  626
Broccoli  150.500000  150.5   62
Carrots   270.000000  270.0  270
Orange    610.000000  610.0  610